/*************************************全局对象设置*******************************************************************/

/** 数据请求设置为同步* */
$.ajaxSetup({
	async : false
});
/** ***********************************全局对象设置****************************************************************** */

/** ***********************************js方法声明****************************************************************** */
/** 校验* */
$("#frm-edit-admin").validate({
	rules : {
		"adminPassword" : {
			rangelength : [ 6, 20 ],
			userNameValidate : true,
		},
		"active" : {
			required : true,
		},
		"sysAdminRoleType" : {
			required : true,
		}
	},
	messages : {
		"adminPassword" : {
			rangelength : "密码名长度必须介于6-20个字符!",
		},
		"active" : {
			required : "请选择用户状态!",
		},
		"sysAdminRoleType" : {
			required : "请选择用户角色"
		}

	}
});
/** ***********************************js方法声明****************************************************************** */

/** ***********************************js方法执行****************************************************************** */

$(document).ready(function() {
	/** 角色加载下拉选项* */
	selectValidityRole();
	/**
	 * 保存按钮事件绑定
	 */
	$("button[name='btn-save']").click(function() {
		/** 校验表单输入* */
		if ($("#frm-edit-admin").valid()) {

			/** 如果修改密码密码加密* */
			if ($("input[name='adminPassword']").val()) {
				$("input[name='adminPassword']").val($.md5($("input[name='adminPassword']").val()));
			}

			/** 调用通用的编辑方法* */
			edit("editSysUser", $("#frm-edit-admin"), "toAccountManangemet");
		}

	});
});
/** ***********************************js方法执行****************************************************************** */
